Revit 2026 API

# Parameter Methods

---

The Parameter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AsDouble | Provides access to the double precision number within the parameter. |
|  | AsElementId | Provides access to the Autodesk::Revit::DB::ElementId^ stored within the parameter. |
|  | AsInteger | Provides access to the integer number within the parameter. |
|  | AssociateWithGlobalParameter | Associates this parameter with a global parameter in the same document. |
|  | AsString | Provides access to the string contents of the parameter. |
|  | AsValueString | Get the parameter value as a string with units. |
|  | AsValueString(FormatOptions) | Get the parameter value as a string with units. |
|  | CanBeAssociatedWithGlobalParameter | Tests whether this parameter can be associated with the given global parameter. |
|  | CanBeAssociatedWithGlobalParameters | Tests whether this parameter can be associated with any global parameter. |
|  | ClearValue | Clears the parameter to its initial value. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | DissociateFromGlobalParameter | Dissociates this parameter from a global parameter. |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAssociatedGlobalParameter | Returns a global parameter, if any, currently associated with this parameter. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetTypeId | Gets the identifier of the parameter. |
|  | GetUnitTypeId | Gets the identifier of the unit quantifying the parameter value. |
|  | Set(Double) | Sets the parameter to a new real number value. |
|  | Set(ElementId) | Sets the parameter to a new element id. |
|  | Set(Int32) | Sets the parameter to a new integer value. |
|  | Set(String) | Sets the parameter to a new string of text. |
|  | SetMultiple |  |
|  | SetValueString | Set the parameter value according to the input string. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace